# في بداية extract_datetime

# ✅ أسماء الشهور مع دعم اللهجة التونسية
month_names_ar = {
    'يناير': 1, 'جانفي': 1,          # تونس/المغرب
    'فبراير': 2, 'فيفري': 2,         # تونس/المغرب
    'مارس': 3,
    'أبريل': 4, 'أفريل': 4,          # تونس/المغرب
    'مايو': 5, 'ماي': 5,             # تونس/المغرب
    'يونيو': 6, 'جوان': 6,           # تونس/المغرب
    'يوليو': 7, 'جويلية': 7,        # تونس/المغرب
    'أغسطس': 8, 'أوت': 8,            # تونس/المغرب
    'سبتمبر': 9, 'شتنبر': 9,        # المغرب
    'أكتوبر': 10, 'كتوبر': 10,
    'نوفمبر': 11, 'نونبر': 11,       # المغرب
    'ديسمبر': 12, 'دجنبر': 12        # المغرب
}